lvx/base/Catalogs/бит_мпд_НастройкиВнешнихПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_мпд_НастройкиВнешнихПодключений</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеБазы</Name>
					<Comment>Серверная/Файловая</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_мпд_ВидыРасположенияИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Comment>Имя сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Comment>Имя базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Comment>Путь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_мпд_ВидыРасположенияИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_мпд_ВидыРасположенияИнформационныхБаз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
					<Comment>Файловая база COM- соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
					<Comment>Серверная база COM - соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RestСервис</Name>
					<Comment>Подключение к автоматическому REST-сервису</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_мпд_НастройкиВнешнихПодключений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ПроверитьПодключение(ТекущаяСтрока.Ссылка) Тогда		
		ТекстСообщения = НСтр("ru='Тестовое подключение успешно выполнено.';en='Test connection is successful done.'");		
	Иначе		
		ТекстСообщения = НСтр("ru='Не удалось выполнить тестовое подключение.';en='Unable to test connection.'");		
	КонецЕсли; 
	
	ЗаголовокСообщения = НСтр("ru='Тестовое подключение';en='Test connection'");	
	ПоказатьПредупреждение(,ТекстСообщения, 15, ЗаголовокСообщения);		
	
КонецПроцедуры // КомандаПроверитьПодключение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция производит тестовое подключение.
// 
// Возвращаемое значение:
//  флУдалось - Булево.
// 
&НаСервере
Функция ПроверитьПодключение(НастройкаПодключения)
	
	флУдалось = Ложь;	
	Если НастройкаПодключения.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
		
		 флУдалось = Справочники.бит_мпд_НастройкиВнешнихПодключений.ТестовоеСоедениеREST(НастройкаПодключения, "Ошибки");
		
	Иначе	
		
		Подключение = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьКОМ(НастройкаПодключения,"Ошибки");
		
		Если Подключение = Неопределено Тогда		
			флУдалось = Ложь; 		
		Иначе	           		
			флУдалось = Истина; 		
		КонецЕсли; 
		
		Подключение = Неопределено;
		
	КонецЕсли; 
	
	Возврат флУдалось;
	
КонецФункции // ПроверитьПодключение()

#КонецОбласти
